export const feeMaster = {
	A: {
		over: null, lessThan: null, price: {
			A: { normal: { '1': 0, '2': 0 }, short: { '1': 0, '2': 0 } }, B: { normal: { '1': 0, '2': 0 }, short: { '1': 0, '2': 0 } }, C: { normal: { '1': 0, '2': 0 }, }
		}
	},
	B: {
		over: null, lessThan: null, price: {
			A: { normal: { '1': 0, '2': 0 }, short: { '1': 0, '2': 0 } }, B: { normal: { '1': 0, '2': 0 }, short: { '1': 0, '2': 0 } }, C: { normal: { '1': 0, '2': 0 }, }
		}
	},
	C1: {
		over: null, lessThan: null, price: {
			A: { normal: { '1': 5300, '2': 2650 }, short: { '1': 5200, '2': 2600 } }, B: { normal: { '1': 3600, '2': 1800 }, short: { '1': 3500, '2': 1750 } }, C: { normal: { '1': 2800, '2': 1400 }, }
		}

	},
	C2: {
		over: 0, lessThan: 5000, price: {
			A: { normal: { '1': 6300, '2': 3150 }, short: { '1': 6100, '2': 3050 } }, B: { normal: { '1': 4100, '2': 2050 }, short: { '1': 4000, '2': 2000 } }, C: { normal: { '1': 3400, '2': 1700 }, }

		}
	},
	C3: {
		over: 5000, lessThan: 48600, price: {
			A: { normal: { '1': 7100, '2': 3550 }, short: { '1': 6900, '2': 3450 } }, B: { normal: { '1': 5000, '2': 2500 }, short: { '1': 4900, '2': 2450 } }, C: { normal: { '1': 3800, '2': 1900 }, }

		}
	},
	C4: {
		over: 48600, lessThan: 50400, price: {
			A: { normal: { '1': 9200, '2': 4600 }, short: { '1': 9000, '2': 4500 } }, B: { normal: { '1': 6500, '2': 3250 }, short: { '1': 6400, '2': 3200 } }, C: { normal: { '1': 4900, '2': 2450 }, }

		}
	},
	C5: {
		over: 50400, lessThan: 60000, price: {
			A: { normal: { '1': 11700, '2': 5850 }, short: { '1': 11500, '2': 5750 } }, B: { normal: { '1': 9400, '2': 4700 }, short: { '1': 9200, '2': 4600 } }, C: { normal: { '1': 7500, '2': 3750 }, }

		}
	},
	C6: {
		over: 60000, lessThan: 70800, price: {
			A: { normal: { '1': 14700, '2': 7350 }, short: { '1': 14400, '2': 7200 } }, B: { normal: { '1': 11800, '2': 5900 }, short: { '1': 11600, '2': 5800 } }, C: { normal: { '1': 9400, '2': 4700 }, }

		}
	},
	C7: {
		over: 70800, lessThan: 84600, price: {
			A: { normal: { '1': 18200, '2': 9100 }, short: { '1': 17800, '2': 8900 } }, B: { normal: { '1': 14600, '2': 7300 }, short: { '1': 14400, '2': 7200 } }, C: { normal: { '1': 11600, '2': 5800 }, }

		}
	},
	C8: {
		over: 84600, lessThan: 97000, price: {
			A: { normal: { '1': 22000, '2': 11000 }, short: { '1': 21600, '2': 10800 } }, B: { normal: { '1': 17600, '2': 8800 }, short: { '1': 17300, '2': 8650 } }, C: { normal: { '1': 14100, '2': 7050 }, }

		}
	},
	C9: {
		over: 97000, lessThan: 108600, price: {
			A: { normal: { '1': 25700, '2': 12850 }, short: { '1': 25200, '2': 12600 } }, B: { normal: { '1': 20600, '2': 10300 }, short: { '1': 20300, '2': 10150 } }, C: { normal: { '1': 16400, '2': 8200 }, }

		}
	},
	C10: {
		over: 108600, lessThan: 123000, price: {
			A: { normal: { '1': 29500, '2': 14750 }, short: { '1': 28900, '2': 14450 } }, B: { normal: { '1': 23600, '2': 11800 }, short: { '1': 23200, '2': 11600 } }, C: { normal: { '1': 18900, '2': 9450 }, }

		}
	},
	C11: {
		over: 123000, lessThan: 138600, price: {
			A: { normal: { '1': 33300, '2': 16650 }, short: { '1': 32700, '2': 16350 } }, B: { normal: { '1': 26600, '2': 13300 }, short: { '1': 26200, '2': 13100 } }, C: { normal: { '1': 21300, '2': 10650 }, }

		}
	},
	C12: {
		over: 138600, lessThan: 154200, price: {
			A: { normal: { '1': 37200, '2': 18600 }, short: { '1': 36500, '2': 18250 } }, B: { normal: { '1': 29800, '2': 14900 }, short: { '1': 29300, '2': 14650 } }, C: { normal: { '1': 23800, '2': 11900 }, }

		}
	},
	C13: {
		over: 154200, lessThan: 169000, price: {
			A: { normal: { '1': 41200, '2': 20600 }, short: { '1': 40500, '2': 20250 } }, B: { normal: { '1': 33000, '2': 16500 }, short: { '1': 32500, '2': 16250 } }, C: { normal: { '1': 26400, '2': 13200 }, }

		}
	},
	C14: {
		over: 169000, lessThan: 183900, price: {
			A: { normal: { '1': 45200, '2': 22600 }, short: { '1': 44400, '2': 22200 } }, B: { normal: { '1': 36200, '2': 18100 }, short: { '1': 35600, '2': 17800 } }, C: { normal: { '1': 28900, '2': 14450 }, }

		}
	},
	C15: {
		over: 183900, lessThan: 204600, price: {
			A: { normal: { '1': 50000, '2': 25000 }, short: { '1': 49100, '2': 24550 } }, B: { normal: { '1': 40000, '2': 20000 }, short: { '1': 39300, '2': 19650 } }, C: { normal: { '1': 32000, '2': 16000 }, }

		}
	},
	C16: {
		over: 204600, lessThan: 234600, price: {
			A: { normal: { '1': 54500, '2': 27250 }, short: { '1': 53500, '2': 26750 } }, B: { normal: { '1': 43600, '2': 21800 }, short: { '1': 42900, '2': 21450 } }, C: { normal: { '1': 34800, '2': 17400 }, }

		}
	},
	C17: {
		over: 234600, lessThan: 258600, price: {
			A: { normal: { '1': 57000, '2': 28500 }, short: { '1': 56000, '2': 28000 } }, B: { normal: { '1': 45600, '2': 22800 }, short: { '1': 44800, '2': 22400 } }, C: { normal: { '1': 36500, '2': 18250 }, }

		}
	},
	C18: {
		over: 258600, lessThan: 276600, price: {
			A: { normal: { '1': 59000, '2': 29500 }, short: { '1': 58000, '2': 29000 } }, B: { normal: { '1': 47200, '2': 23600 }, short: { '1': 46400, '2': 23200 } }, C: { normal: { '1': 37800, '2': 18900 }, }

		}
	},
	C19: {
		over: 276600, lessThan: 301000, price: {
			A: { normal: { '1': 60500, '2': 30250 }, short: { '1': 59400, '2': 29700 } }, B: { normal: { '1': 48400, '2': 24200 }, short: { '1': 47600, '2': 23800 } }, C: { normal: { '1': 38700, '2': 19350 }, }

		}
	},
	C20: {
		over: 301000, lessThan: 321700, price: {
			A: { normal: { '1': 65500, '2': 32750 }, short: { '1': 64300, '2': 32150 } }, B: { normal: { '1': 52400, '2': 26200 }, short: { '1': 51500, '2': 25750 } }, C: { normal: { '1': 41900, '2': 20950 }, }

		}
	},
	C21: {
		over: 321700, lessThan: 341200, price: {
			A: { normal: { '1': 70000, '2': 35000 }, short: { '1': 68800, '2': 34400 } }, B: { normal: { '1': 56000, '2': 28000 }, short: { '1': 55100, '2': 27550 } }, C: { normal: { '1': 44800, '2': 22400 }, }

		}
	},
	C22: {
		over: 341200, lessThan: 366700, price: {
			A: { normal: { '1': 73000, '2': 36500 }, short: { '1': 71700, '2': 35850 } }, B: { normal: { '1': 58400, '2': 29200 }, short: { '1': 57400, '2': 28700 } }, C: { normal: { '1': 46700, '2': 23350 }, }

		}
	},
	C23: {
		over: 366700, lessThan: 397000, price: {
			A: { normal: { '1': 74000, '2': 37000 }, short: { '1': 72700, '2': 36350 } }, B: { normal: { '1': 59200, '2': 29600 }, short: { '1': 58200, '2': 29100 } }, C: { normal: { '1': 47300, '2': 23650 }, }

		}
	},
	C24: {
		over: 397000, lessThan: 475300, price: {
			A: { normal: { '1': 81500, '2': 40750 }, short: { '1': 80100, '2': 40050 } }, B: { normal: { '1': 65200, '2': 32600 }, short: { '1': 64100, '2': 32050 } }, C: { normal: { '1': 52100, '2': 26050 }, }

		}
	},
	C25: {
		over: 475300, lessThan: 99999999999, price: {
			A: { normal: { '1': 82800, '2': 41400 }, short: { '1': 81400, '2': 40700 } }, B: { normal: { '1': 66200, '2': 33100 }, short: { '1': 65100, '2': 32550 } }, C: { normal: { '1': 52900, '2': 26450 }, }

		}
	},

}


export const UsageAdjustmentMaster = {
	parentCondition: {
		1: {
			firstChoice: "居宅外労働 (自営を除く) ",
			secondChoiceValue: [
				{ choice: "月実働１４０時間以上就労", rank: "Ａ" },
				{ choice: "月実働１２０時間以上１４０時間未満就労", rank: "Ｂ" },
				{ choice: "月実働１００時間以上１２０時間未満就労", rank: "Ｃ" },
				{ choice: "月実働８０時間以上１００時間未満就労", rank: "Ｄ" },
				{ choice: "月実働６４時間以上８０時間未満就労", rank: "Ｅ" },
			]
		},
		2: {
			firstChoice: "居宅外労働 (自営を除く) ",
			secondChoiceValue: [
				{ choice: "【中心者】月実働１４０時間以上就労", rank: "Ａ" },
				{ choice: "【中心者】月実働１２０時間以上１４０時間未満就労", rank: "Ｂ" },
				{ choice: "【中心者】月実働１００時間以上１２０時間未満就労", rank: "Ｃ" },
				{ choice: "【中心者】月実働８０時間以上１００時間未満就労", rank: "Ｄ" },
				{ choice: "【中心者】月実働６４時間以上８０時間未満就労", rank: "Ｅ" },
				{ choice: "【協力者】就労先確定(注２)", rank: "Ｆ" },
				{ choice: "【協力者】月実働１４０時間以上就労", rank: "Ｂ" },
				{ choice: "【協力者】月実働１２０時間以上１４０時間未満就労", rank: "Ｃ" },
				{ choice: "【協力者】月実働１００時間以上１２０時間未満就労", rank: "Ｄ" },
				{ choice: "【協力者】月実働８０時間以上１００時間未満就労", rank: "Ｅ" },
				{ choice: "【協力者】月実働６４時間以上８０時間未満就労", rank: "Ｆ" },
				{ choice: "【協力者】就労先確定(注２)", rank: "Ｇ" },
			]
		},
		3: {
			firstChoice: "妊娠・出産",
			secondChoiceValue: [
				{ choice: "出産予定日の約２か月前から出産後２か月程度までの間で、分娩・休養のため保育に当たることができない場合 切迫流産等は「疾病」と扱う。", rank: "Ｄ" },
			],
		},
		4: {
			firstChoice: "疾病・負傷・心身障害",
			secondChoiceValue: [
				{ choice: "(1) 疾病・負傷により常時臥床又は１か月以上の入院 (2) 重度の心身障害(いずれも同程度の障害を有する場合を含む。) ", rank: "Ａ" },
				{ choice: "疾病・負傷の治療や療養のため１か月以上の自宅での安静加療を指示されている場合", rank: "C" },
				{ choice: "慢性疾患・長期疾病のため病床で過ごさないが、１か月以上自宅での療養を指示されている場合", rank: "E" },
			]
		},
		5: {
			firstChoice: "介護",
			secondChoiceValue: [
				{ choice: "【病院等居宅外での介護	】介護に要する日数及び時間をもとに、番号１の細目を準用", rank: "Ａ～Ｅ" },
				{ choice: "【居宅内での介護(通院・通所の付添いを含む。)	】通院・通所に要する時間を含め介護に要する日数及び時間をもとに、番号１の細目を準用。ただし、介護サービス等が利用できる時間は除く。", rank: "Ａ～Ｅ" },
			]
		},

		6: {
			firstChoice: "災害復旧",
			secondChoiceValue: [
				{ choice: "災害の状況、復旧に要する日数及び時間等をもとに番号１の細目を準用", rank: "Ａ～Ｅ" },
			]
		},
		7: {
			firstChoice: "就学",
			secondChoiceValue: [
				{ choice: "卒業後就労を目的とし、職業訓練校や大学等へ通学する場合、休憩及び通学時間を除き、保育に当たることができない日数及び時間をもとに、番号１の細目を準用", rank: "Ａ～F" },
			]
		},
		8: {
			firstChoice: "求職活動等",
			secondChoiceValue: [
				{ choice: "求職又は起業の準備のため外出することを常態としている場合", rank: "H" },
			]
		},
		9: {
			firstChoice: "市長による特例",
			secondChoiceValue: [
				{ choice: "ひとり親世帯等	", rank: "Ａ～Ｆ" },
				{ choice: "生計中心者の失業	", rank: "Ａ～Ｆ" },
				{ choice: "その他	", rank: "Ａ～Ｈ" },
			]
		},


	},

	/**調整指数 */
	adjustmentIndex: {
		1: {
			firstChoice: "世帯状況 ",
			secondChoiceValue: [
				{ choice: "(1) 両親不存在世帯", indexNumber: "15" },
				{ choice: "(2) 母子世帯", indexNumber: "10" },
				{ choice: "(3) 父子世帯", indexNumber: "10" },
				{ choice: "(4) 生活保護世帯等", indexNumber: "7" },
				{ choice: "(5) 別表１で優先されている「ひとり親世帯等」", indexNumber: "7" },
				{ choice: "(6) 別表１で優先されている「生計中心者の失業」", indexNumber: "7" },
			]
		},


		2: {
			firstChoice: "連携施設が設定されていない地域型保育事業の卒園児(注１)",
			secondChoiceValue: [
				{ choice: "卒園後の受け皿となる連携施設が設定されていない地域型保育事業等を卒園した場合の経過措置", indexNumber: "7" },
			]
		},
		3: {
			firstChoice: "地域型保育事業卒園児で、連携施設を希望しない場合",
			secondChoiceValue: [
				{ choice: "地域型保育事業等を卒園し、卒園後の受け皿となっている連携施設への入所を希望しない場合", indexNumber: "2" },
			]
		},
		4: {
			firstChoice: "就労実績 (注２)",
			secondChoiceValue: [
				{ choice: "利用希望日時点で１年以上の就労実績がある場合", indexNumber: "2" },
				{ choice: "利用希望日時点で半年以上の就労実績がある場合", indexNumber: "1" },
			]
		},
		5: {
			firstChoice: "認可外保育施設等の利用状況",
			secondChoiceValue: [
				{ choice: "保護者の就労等により、他に児童を保育する者なく、認可外保育施設等に預けている場合、又は転居やきょうだい同園利用希望による幼稚園・特定教育・保育施設若しくは地域型保育事業実施施設からの転園の場合(就労状況等と連動した利用の場合)", indexNumber: "2" },
			]
		},
		6: {
			firstChoice: "児童を養育する環境",
			secondChoiceValue: [
				{ choice: "危険なものを扱う業種に従事しているが、他に児童を保育する者なくやむを得ず職場に連れて行く場合", indexNumber: "1" },
			]
		},
		7: {
			firstChoice: "同居の親族等の状況 (注３)",
			secondChoiceValue: [
				{ choice: "保護者の就労等により、他に児童を保育する者なく、認可外保育施設等に預けている場合、又は転居やきょうだい同園利用希望による幼稚園・特定教育・保育施設若しくは地域型保育事業実施施設からの転園の場合(就労状況等と連動した利用の場合)", indexNumber: "2" },
			]
		},
		8: {
			firstChoice: "産休明け又は育休明け (注４)",
			secondChoiceValue: [
				{ choice: "産休明け、育休明け予定者(４月１日入所については、一次選考の申込期限以降から４月中の復帰者を含む。)", indexNumber: "2" },
			]
		},
		9: {
			firstChoice: "今回の申込み以前に育児休業を取得し退所した児童",
			secondChoiceValue: [
				{ choice: "特定教育・保育施設、地域型保育事業実施施設を利用していたが、保護者が育児休業を取得し、自主的に退所した場合において、育児休業終了後、当該施設に再度申込みをした場合。ただし、当該児童のきょうだいについては、この限りではない。", indexNumber: "10" },
			]
		},
		10: {
			firstChoice: "今回の申込み以前に育児休業を取得し退所した児童 保護者が重度の心身障害の場合(注５)",
			secondChoiceValue: [
				{ choice: "特定教育・保育施設、地域型保育事業実施施設を利用していたが、保護者が育児休業を取得し、自主的に退所した場合において、育児休業終了後、当該施設に再度申込みをした場合。ただし、当該児童のきょうだいについては、この限りではない。", indexNumber: "10,5,3" },
			]
		},
		11: {
			firstChoice: "福祉事務所長が特に必要と認めた場合",
			secondChoiceValue: [
				{ choice: "上記項目に該当しないが、児童福祉の観点から、福祉事務所長が緊急に保育の実施を必要と認めた場合  例)過去に虐待や児童相談所等による保護の経緯があるなど、児童の心身に危険が及ぶ可能性が高く、社会的養護が必要な場合", indexNumber: "15" },
			]
		},
	}

}
